Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70N19.PIC
      <edc:SFRDef edc:_addr="0x400381DC" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381E0" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381E4" edc:access="------------rrrr-rrr----rrrrrrrr" edc:cname="USBHS_DEVEPTIMR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINE" edc:desc="Transmitted IN Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:desc="Received OUT Data Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPE" edc:desc="Received SETUP Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTE" edc:desc="NAKed OUT Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINE" edc:desc="NAKed IN Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDE" edc:desc="STALLed Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:desc="Short Packet Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:desc="Endpoint Interrupts Disable HDMA Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:desc="STALL Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400381E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400381F0" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER0" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381F4" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381F8" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER2" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400381FC" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER3" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
