Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70N19.PIC
      <edc:SFRDef edc:_addr="0x40050008" edc:access="-----------------------------rr-" edc:cname="GMAC_NSR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDIO" edc:desc="MDIO Input Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="PHY Management Logic Idle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005000C" edc:access="-------------------------------n" edc:cname="GMAC_UR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RMII" edc:desc="Reduced MII Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050010" edc:access="-------nnnnnnnnn----nnnnnn-nnnnn" edc:cname="GMAC_DCFGR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FBLDO" edc:desc="Fixed Burst Length for DMA Data Operations:" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="00001: Always use SINGLE AHB bursts" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:desc="001xx: Attempt to use INCR4 AHB bursts (Default)" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:desc="01xxx: Attempt to use INCR8 AHB bursts" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="INCR16" edc:desc="1xxxx: Attempt to use INCR16 AHB bursts" edc:when="(field &amp; 0x1F) == 0x10"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ESMA" edc:desc="Endian Swap Mode Enable for Management Descriptor Accesses" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESPA" edc:desc="Endian Swap Mode Enable for Packet Data Accesses" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBMS" edc:desc="Receiver Packet Buffer Memory Size Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="EIGHTH" edc:desc="4/8 Kbyte Memory Size" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="QUARTER" edc:desc="4/4 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="4/2 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="4 Kbytes Memory Size" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXPBMS" edc:desc="Transmitter Packet Buffer Memory Size Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCOEN" edc:desc="Transmitter Checksum Generation Offload Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRBS" edc:desc="DMA Receive Buffer Size" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DDRP" edc:desc="DMA Discard Receive Packets" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050014" edc:access="-----------------------n--nnnnnn" edc:cname="GMAC_TSR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UBR" edc:desc="Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COL" edc:desc="Collision Occurred" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLE" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXGO" edc:desc="Transmit Go" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050018" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_RBQB" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005001C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="GMAC_TBQB" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050020" edc:access="----------------------------nnnn" edc:cname="GMAC_RSR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BNA" edc:desc="Buffer Not Available" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HNO" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050024" edc:access="---r-rrrrrrrrr---rrrrr--rrrrrrrr" edc:cname="GMAC_ISR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050028" edc:access="---w-wwwwwwwww--wwwwww--wwwwwwww" edc:cname="GMAC_IER" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005002C" edc:access="---w-wwwwwwwww--wwwwww--wwwwwwww" edc:cname="GMAC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
